class Constants:
    """Константы."""

    slug_max_length = 32  # Макс. кол-во символов идентификатора.
    category_name_max_length = 128  # Макс. кол-во символов названия категории.
    product_name_max_length = 128  # Макс. кол-во символов названия продукта.
    price_min_value = 0  # Мин. цена продукта.
    price_default_value = 1  # Значение по умолчанию цены продукта.
    amount_default_value = 1  # Значение по умолчанию кол-ва продукта.
    product_min_amount = 1  # Мин. кол-во продукта в корзине.
    product_max_amount = 100  # Макс. кол-во продукта в корзине.
    username_max_length = 150  # Макс. кол-во символов юзернейма пользователя.
    email_max_length = 254  # Макс. кол-во символов адреса электронной почты.
    first_name_max_length = 150  # Макс. кол-во символов имени пользователя.
    last_name_max_length = 150  # Макс. кол-во символов фамилии пользователя.
